Revit 2027 API
EnergyAnalysisSurface.OriginatingElementDescription Property
 The description for the originating Revit element.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OriginatingElementDescription { get; }
Public ReadOnly Property OriginatingElementDescription As String
	Get
public:
property String^ OriginatingElementDescription {
	String^ get ();
}
member OriginatingElementDescription : string with get
Property Value
String
Remarks
 Surface and Opening elements get an originating element assigned according to the below described schema, based on associative room bounding element:
(Family Name): (Family Type)[Element Id]
Sample: Basic Wall: Cast Concrete Wall 12" [49749]
See Also
Reference
EnergyAnalysisSurface Class
Autodesk.Revit.DB.Analysis Namespace